{"config": [{"config": {"b_regularizer": null, "input_dtype": "float32", "W_regularizer": null, "name": "convolution2d_1", "bias": true, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "nb_filter": 24, "init": "glorot_uniform", "subsample": [2, 2], "activation": "relu", "batch_input_shape": [null, 66, 200, 3], "nb_col": 5, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_regularizer": null, "name": "convolution2d_2", "subsample": [2, 2], "bias": true, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "nb_filter": 36, "init": "glorot_uniform", "activation": "relu", "nb_col": 5, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_regularizer": null, "name": "convolution2d_3", "subsample": [2, 2], "bias": true, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "nb_filter": 48, "init": "glorot_uniform", "activation": "relu", "nb_col": 5, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_regularizer": null, "name": "convolution2d_4", "subsample": [1, 1], "bias": true, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "nb_col": 3, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "W_regularizer": null, "name": "convolution2d_5", "subsample": [1, 1], "bias": true, "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "nb_col": 3, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "input_dim": 1152, "W_regularizer": null, "name": "dense_1", "bias": true, "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "init": "uniform", "W_constraint": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "input_dim": 100, "W_regularizer": null, "name": "dense_2", "bias": true, "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "init": "uniform", "W_constraint": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "input_dim": 50, "W_regularizer": null, "name": "dense_3", "bias": true, "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "tanh", "init": "uniform", "W_constraint": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "input_dim": 10, "W_regularizer": null, "name": "y_pred", "bias": true, "trainable": true, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}