{"keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"activation": "relu", "W_constraint": null, "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "subsample": [2, 2], "b_regularizer": null, "name": "convolution2d_1", "nb_col": 5, "activity_regularizer": null, "bias": true, "nb_filter": 24, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "W_constraint": null, "nb_filter": 36, "subsample": [2, 2], "b_regularizer": null, "name": "convolution2d_2", "nb_col": 5, "activity_regularizer": null, "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "W_constraint": null, "nb_filter": 48, "subsample": [2, 2], "b_regularizer": null, "name": "convolution2d_3", "nb_col": 5, "activity_regularizer": null, "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "W_constraint": null, "nb_filter": 64, "subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_4", "nb_col": 3, "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "W_constraint": null, "nb_filter": 64, "subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_5", "nb_col": 3, "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_dim": 1152, "b_regularizer": null, "output_dim": 100, "bias": true, "trainable": true, "name": "dense_1", "W_regularizer": null, "init": "uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_dim": 100, "b_regularizer": null, "output_dim": 50, "bias": true, "trainable": true, "name": "dense_2", "W_regularizer": null, "init": "uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "tanh", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_dim": 50, "b_regularizer": null, "output_dim": 10, "bias": true, "trainable": true, "name": "dense_3", "W_regularizer": null, "init": "uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "input_dim": 10, "b_regularizer": null, "output_dim": 1, "bias": true, "trainable": true, "name": "y_pred", "W_regularizer": null, "init": "glorot_uniform"}}], "class_name": "Sequential"}